darren1713/elua/src/platform/sim3u1xx/platform.c
// Platform-dependent functions

#include "platform.h"
#include "type.h"
#include "devman.h"
#include "genstd.h"
#include "stacks.h"
#include <reent.h>
#include <errno.h>
#include <string.h>
#include <ctype.h>
#include <stdio.h>
#include "utils.h"
#include "common.h"
#include "elua_adc.h"
#include "platform_conf.h"
#include "lrotable.h"
#include "buf.h"
#include "sermux.h"
#include "romfs.h"

// Platform includes
#include "sim3u1xx.h"
#include "sim3u1xx_Types.h"

// FreakUSB
#include "cdc.h"
#include "freakusb.h"
#include "hw.h"

// Generated code includes
#include <SI32_PBCFG_A_Type.h>
#include <SI32_PBSTD_A_Type.h>
#include <si32_device.h>
#include <SI32_RTC_A_Type.h>
#include <SI32_RSTSRC_A_Type.h>
#include <SI32_VREG_A_Type.h>
#include <SI32_PMU_A_Type.h>
#include <SI32_SARADC_A_Type.h>
#include <SI32_LDO_A_Type.h>
#include <SI32_SPI_A_Type.h>
#include "myPB.h"
#include <gVMON0.h>
#include <gLDO0.h>
#include <gVREG0.h>
#include <gRSTSRC0.h>

// ****************************************************************************
// Platform initialization

#define PIN_CHECK_INTERVAL 10

int wake_reason = WAKE_UNKNOWN;

// Watchdog timer
#define PLATFORM_EARLY_WARNING_DELAY_MS        1000   // ms, periodic early warning interrupt

#define PLATFORM_RESET_DELAY_MS                3000 // ms, reset delay (if early warning isn't captured)

#define PLATFORM_EARLY_WARNING_THRESHOLD       (uint32_t)((16400*PLATFORM_EARLY_WARNING_DELAY_MS)/1000)
#define PLATFORM_RESET_THRESHOLD               (uint32_t)((16400*PLATFORM_RESET_DELAY_MS)/1000)

#ifdef EXTRA_SLEEP_HOOK
extern void extras_sleep_hook( int seconds );
#endif

//I2C
#define I2C_TIMEOUT_SYSTICKS 3
static volatile int i2c_timeout_timer = I2C_TIMEOUT_SYSTICKS;

#if defined( PCB_V10 )
#define PIN_HV_BANK SI32_PBSTD_3
#define PIN_HV_PIN ( 1 << 8 )
#endif

#if defined( PCB_V10 )
  #define PIN_VCC_BANK 4
  #define PIN_VCC_PIN ( ( u32 ) 1 << 5 )
  #define PIN_NRST_BANK 3
  #define PIN_NRST_PIN ( ( u32 ) 1 << 10 )
  #define PIN_ONOFF_BANK 0
  #define PIN_ONOFF_PIN ( ( u32 ) 1 << 1 )
#endif

int rram_reg[RRAM_SIZE] __attribute__((section(".sret")));
static int rtc_remaining = 0;
static u8 sleep_delay = 0;
static u8 pending_op_timeout = 0;
static u8 pending_op_used = 0;

void sim3_pmu_reboot( void );
void sim3_pmu_reboot_nodfu( void );

extern int load_lua_function (char *func);

// forward dcls
static void pios_init();
static void clk_init();
static void rtc_init();
static void adcs_init();
static void gTIMER0_enter_auto_reload_config(void);
static void gTIMER1_enter_auto_reload_config(void);

timer_data_type last_wdt_time, cur_wdt_time = 0;

// Reference: http://stackoverflow.com/q/2422712/105950
int div_round_closest( const int numerator, const int denominator )
{
  if( ( ( numerator >= 0 ) && ( denominator >= 0 ) ) ||
      ( ( numerator <  0 ) && ( denominator <  0 ) ) )
 {
    // Both are positive or negative, positive result
    if( denominator == 0 )
      return INT_MAX;
    else
      return ( numerator + denominator / 2 ) / denominator;
  }
  else
  {
    // One is postive the other is negative, negative result
    if( denominator == 0 )
      return INT_MIN;
    else
      return ( numerator - denominator / 2 ) / denominator;
  }
}

void hard_fault_handler_c(unsigned int * hardfault_args)
{
  FILE *fp;

  unsigned int stacked_r0;
  unsigned int stacked_r1;
  unsigned int stacked_r2;
  unsigned int stacked_r3;
  unsigned int stacked_r12;
  unsigned int stacked_lr;
  unsigned int stacked_pc;
  unsigned int stacked_psr;

  stacked_r0 = ((unsigned long) hardfault_args[0]);
  stacked_r1 = ((unsigned long) hardfault_args[1]);
  stacked_r2 = ((unsigned long) hardfault_args[2]);
  stacked_r3 = ((unsigned long) hardfault_args[3]);

  stacked_r12 = ((unsigned long) hardfault_args[4]);
  stacked_lr = ((unsigned long) hardfault_args[5]);
  stacked_pc = ((unsigned long) hardfault_args[6]);
  stacked_psr = ((unsigned long) hardfault_args[7]);

  printf ("[Hard fault handler]\n");
  printf ("R0 = %x\n", stacked_r0);
  printf ("R1 = %x\n", stacked_r1);
  printf ("R2 = %x\n", stacked_r2);
  printf ("R3 = %x\n", stacked_r3);
  printf ("R12 = %x\n", stacked_r12);
  printf ("LR = %x\n", stacked_lr);
  printf ("PC = %x\n", stacked_pc);
  printf ("PSR = %x\n", stacked_psr);
  printf ("BFAR = %x\n", (*((volatile unsigned  *)(0xE000ED38))));
  printf ("CFSR = %x\n", (*((volatile unsigned  *)(0xE000ED28))));
  printf ("HFSR = %x\n", (*((volatile unsigned  *)(0xE000ED2C))));
  printf ("DFSR = %x\n", (*((volatile unsigned  *)(0xE000ED30))));
  printf ("AFSR = %x\n", (*((volatile unsigned  *)(0xE000ED3C))));
  printf ("\n");
  printf ("\n");
  printf ("\n");

  // Write out hard fault data to file
  #if defined( BUILD_NIFFS )
  fp = fopen("/f/._hardfault", "w");
  #else
  fp = fopen("/wo/._hardfault", "w");
  #endif
  if( fp != NULL )
  {
    fprintf (fp, "[Last hard fault]\n");
    fprintf (fp, "R0 = %x\n", stacked_r0);
    fprintf (fp, "R1 = %x\n", stacked_r1);
    fprintf (fp, "R2 = %x\n", stacked_r2);
    fprintf (fp, "R3 = %x\n", stacked_r3);
    fprintf (fp, "R12 = %x\n", stacked_r12);
    fprintf (fp, "LR = %x\n", stacked_lr);
    fprintf (fp, "PC = %x\n", stacked_pc);
    fprintf (fp, "PSR = %x\n", stacked_psr);
    fprintf (fp, "BFAR = %x\n", (*((volatile unsigned  *)(0xE000ED38))));
    fprintf (fp, "CFSR = %x\n", (*((volatile unsigned  *)(0xE000ED28))));
    fprintf (fp, "HFSR = %x\n", (*((volatile unsigned  *)(0xE000ED2C))));
    fprintf (fp, "DFSR = %x\n", (*((volatile unsigned  *)(0xE000ED30))));
    fprintf (fp, "AFSR = %x\n", (*((volatile unsigned  *)(0xE000ED3C))));
    printf ("\n");
    fclose( fp );
  }

  sim3_hard_fault_cleanup();

  sim3_pmu_reboot();
}

/**
  * @brief  This function handles Hard Fault exception.
  * @param  None
  * @retval None
  */
void HardFault_Handler(void)
{
  asm(
  "tst lr, #4\n\t"
  "ite eq\n\t"
  "mrseq r0, msp\n\t"
  "mrsne r0, psp\n\t"
  "b hard_fault_handler_c"
  );
}

volatile u16 wdt_reset_counter = 20;

void watchdog_counter_set( u16 value )
{
  wdt_reset_counter = value;
}

void WDTIMER0_IRQHandler(void)
{
  u8 rng_tmp, rng_drain;
    if ((SI32_WDTIMER_A_is_early_warning_interrupt_pending(SI32_WDTIMER_0) &
        SI32_WDTIMER_A_is_early_warning_interrupt_enabled(SI32_WDTIMER_0)))
    {
      if( wdt_reset_counter > 0 )
      {
        SI32_WDTIMER_A_reset_counter( SI32_WDTIMER_0 );
        SI32_WDTIMER_A_clear_early_warning_interrupt( SI32_WDTIMER_0 );

        wdt_reset_counter--;
      }

      cur_wdt_time = platform_timer_read( PLATFORM_TIMER_SYS_ID );
      rng_tmp = platform_timer_get_diff_us( PLATFORM_TIMER_SYS_ID, last_wdt_time, cur_wdt_time ) % 256;

      if( buf_is_enabled( BUF_ID_RNG, 0 ) )
      {
        // Burn off old entropy if unused
        if( buf_get_count( BUF_ID_RNG, 0 ) == buf_get_size( BUF_ID_RNG, 0 ) )
          buf_read(BUF_ID_RNG, 0, ( t_buf_data* )&rng_drain );

        buf_write(BUF_ID_RNG, 0, ( t_buf_data* )&rng_tmp );
      }

      last_wdt_time = cur_wdt_time;

