darren1713/elua/src/platform/sim3u1xx/platform.c
#if 1 //Option to disable Watchdog Timer
  // Enable Watchdog Timer
  SI32_WDTIMER_A_start_counter(SI32_WDTIMER_0);

  /// Enable Watchdog Interrupt
  NVIC_ClearPendingIRQ(WDTIMER0_IRQn);
  SI32_WDTIMER_A_enable_early_warning_interrupt(SI32_WDTIMER_0);
  SI32_RSTSRC_A_enable_watchdog_timer_reset_source(SI32_RSTSRC_0);
  NVIC_EnableIRQ(WDTIMER0_IRQn);
#endif

#ifdef BUILD_ADC
  // Setup ADCs
  adcs_init();
#endif

#if defined( BUILD_USB_CDC )
  usb_init();
  hw_init();

  // init the class driver here
  cdc_init();

  // register the rx handler function with the cdc
  cdc_reg_rx_handler(NULL);
#endif //defined( BUILD_USB_CDC )

  // Common platform initialization code
  cmn_platform_init();

  wake_init();

  return PLATFORM_OK;
}

void clk_init( void )
{
#if defined( LOW_SYSTEM_CLOCK )
  while( SI32_CLKCTRL_A_are_system_clocks_busy( SI32_CLKCTRL_0 ) );
  SI32_CLKCTRL_A_select_ahb_divider(SI32_CLKCTRL_0, SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV4_VALUE);

  // Set system clock to AHB divider frequency
  SystemCoreClock = 5000000;
#endif
#if defined( ELUA_BOARD_GSATMICRO_V10 )
  SI32_CLKCTRL_A_enable_apb_to_modules_0(SI32_CLKCTRL_0,
                                         SI32_CLKCTRL_A_APBCLKG0_PB0 |
                                         SI32_CLKCTRL_A_APBCLKG0_USART0 |
                                         SI32_CLKCTRL_A_APBCLKG0_USART1 |
                                         SI32_CLKCTRL_A_APBCLKG0_UART0 |
                                         SI32_CLKCTRL_A_APBCLKG0_UART1 |
                                         SI32_CLKCTRL_A_APBCLKG0_SPI1 |
                                         SI32_CLKCTRL_A_APBCLKG0_I2C0 |
                                         SI32_CLKCTRL_A_APBCLKG0_SARADC1 |
                                         SI32_CLKCTRL_A_APBCLKG0_AES0 |
                                         SI32_CLKCTRL_A_APBCLKG0_CRC0 |
                                         SI32_CLKCTRL_A_APBCLKG0_LPTIMER0 |
                                         SI32_CLKCTRL_A_APBCLKG0_USB0 |
                                         SI32_CLKCTRL_A_APBCLKG0_FLASHCTRL0 |
                                         SI32_CLKCTRL_A_APBCLKG0_CMP0 |
                                         SI32_CLKCTRL_A_APBCLKG0_EPCA0
                                         );
  SI32_CLKCTRL_A_enable_apb_to_modules_1(SI32_CLKCTRL_0,
                                         SI32_CLKCTRL_A_APBCLKG1_MISC1 |
                                         SI32_CLKCTRL_A_APBCLKG1_MISC0);
  //SI32_CLKCTRL_A_enable_ahb_to_emif(SI32_CLKCTRL_0);

#else
  SI32_CLKCTRL_A_enable_apb_to_modules_0(SI32_CLKCTRL_0,
                                         SI32_CLKCTRL_A_APBCLKG0_PB0 |
                                         SI32_CLKCTRL_A_APBCLKG0_USART0 |
                                         SI32_CLKCTRL_A_APBCLKG0_USART1 |
                                         SI32_CLKCTRL_A_APBCLKG0_UART0 |
                                         SI32_CLKCTRL_A_APBCLKG0_UART1 |
                                         SI32_CLKCTRL_A_APBCLKG0_CMP0);
  SI32_CLKCTRL_A_enable_apb_to_modules_1(SI32_CLKCTRL_0,
                                         SI32_CLKCTRL_A_APBCLKG1_MISC1 |
                                         SI32_CLKCTRL_A_APBCLKG1_MISC0);
#endif
}
void RTC0ALRM_IRQHandler()
{
  if (SI32_RTC_A_is_alarm0_interrupt_pending(SI32_RTC_0))
  {
    SI32_RTC_A_clear_alarm0_interrupt(SI32_RTC_0);
    //printf("Alarm\n");
  }
}

void rtc_init( void )
{
  SI32_RTC_A_enable_high_speed_mode(SI32_RTC_0);
  // Low Frequency Oscillator Mode
  SI32_RTC_A_enable_low_frequency_oscillator(SI32_RTC_0);
  SI32_RTC_A_set_clock_source_lfo(SI32_RTC_0);
  SI32_RTC_A_disable_crystal_oscillator(SI32_RTC_0);

  SI32_RTC_A_enable_module(SI32_RTC_0);

  SI32_RTC_A_start_timer(SI32_RTC_0);
  SI32_RTC_A_enable_alarm0_auto_reset(SI32_RTC_0);
  SI32_RTC_A_write_alarm0(SI32_RTC_0, 0xF000);
  SI32_RTC_A_clear_alarm0_interrupt(SI32_RTC_0);

  SI32_RTC_A_enable_alarm0_interrupt(SI32_RTC_0);

  NVIC_ClearPendingIRQ(RTC0ALRM_IRQn);
  NVIC_EnableIRQ(RTC0ALRM_IRQn);
}

extern u32 SystemCoreClock;
u32 cmsis_get_cpu_frequency()
{
  return SystemCoreClock;
}
static u8 firstSecond = 1;
static u8 tickSeconds = 0;

void SecondsTick_Handler()
{
  external_io_check();

  //Check if we are supposed to be sleeping
  if(rram_read_int(RRAM_INT_SLEEPTIME) > 0)
  {
    //Don't count down timer if buttons are depressed
    if(rram_read_int(RRAM_INT_SLEEPTIME) != SLEEP_FOREVER)
    {
      if(rram_read_int(RRAM_INT_SLEEPTIME) != 1 || ( !external_buttons() && ok_to_sleep() == OKTOSLEEP ) )
        rram_write_int(RRAM_INT_SLEEPTIME, rram_read_int(RRAM_INT_SLEEPTIME)-1);
    }

    if(rram_read_int(RRAM_INT_SLEEPTIME) == 0)
    {
      //Our timer has expired and we are still powered, start TX script
      //Do a software reboot UNTIL we get the memory leaks sorted out...
      //sim3_pmu_reboot();
#ifdef BUILD_WOFS
      //Test if WOFS file system is low on free sectors, then reboot to trigger WOFS repack
      //UNLIKELY as moving forward we are using NIFFS file system
      printf("Free Sectors: %d\n", wofs_free_sectors() );
      if( wofs_free_sectors() <= 3 )
        sim3_pmu_reboot_nodfu();
#ifdef REBOOT_AT_END_OF_SLEEP
      else
        sim3_pmu_reboot_nodfu();
#endif
#endif
      //Normally we would run the startup script, but fix memory leaks first...
      //printf("startup %i\n", load_lua_function("autorun"));
      //printf("wakeup\n");
      reset_seconds_awake();
      pending_op_used = 0;
      cmn_int_handler( INT_BOOT, 0 );
      //printf("wakeup %i\n", load_lua_string("wakeup();\n"));
    }

    if( ( !external_power() || ( ( rram_read_bit(RRAM_BIT_SLEEP_WHEN_POWERED) == SLEEP_WHEN_POWERED_ACTIVE ) && !usb_power() ) ) && 
        ( rram_read_bit( RRAM_BIT_SLEEP_WITH_BATTERY ) == SLEEP_WITH_BATTERY_ACTIVE ) &&
        !external_buttons() && !external_io() && !bluetooth_connected() && ( ( pending_op_timeout == 0 ) || ( !lua_command_pending() && !c_command_pending() && !extras_op_pending() ) ) )
    {
      printf("no power %i\n", rram_read_int(RRAM_INT_SLEEPTIME));
      if(sleep_delay > 0)
        sleep_delay--;
      else
        sim3_pmu_pm9( rram_read_int(RRAM_INT_SLEEPTIME) );
    }
    else
    {
      if( lua_command_pending() )
      {
        //printf("lua command pending\n");
        wake_reason = WAKE_PENDINGOP;
      }
      if( extras_op_pending() )
      {
        //printf("extras op pending\n");
        wake_reason = WAKE_PENDINGOP;
      }
      if( c_command_pending() )
      {
        //printf("c command pending\n");
        wake_reason = WAKE_PENDINGOP;
      }
      if( external_buttons() )
      {
        //printf("external buttons\n");
        wake_reason = WAKE_WAKEPIN;
      }
      if( external_io() )
      {
        //printf("external io\n");
        wake_reason = WAKE_IO;
      }
      if( bluetooth_connected() )
      {
        //printf("bluetooth connected\n");
        wake_reason = WAKE_BLUETOOTH;
      }
      if( ( ( rram_read_bit(RRAM_BIT_SLEEP_WHEN_POWERED) == SLEEP_WHEN_POWERED_ACTIVE ) && usb_power() ) ||
          ( ( rram_read_bit(RRAM_BIT_SLEEP_WHEN_POWERED) == SLEEP_WHEN_POWERED_DISABLED ) && external_power() ) ||
          ( rram_read_bit( RRAM_BIT_SLEEP_WITH_BATTERY ) == SLEEP_WITH_BATTERY_DISABLED ) )
      {
        //printf("external power\n");
        wake_reason = WAKE_POWERCONNECTED;
      }
    }
    if( pending_op_timeout > 0 && wake_reason == WAKE_PENDINGOP )
    {
      printf("pending op %i\n", pending_op_timeout);
      pending_op_timeout--;
    }

    //else if(rram_read_int(RRAM_INT_SLEEPTIME) != SLEEP_FOREVER &&
    //  ( ( ( rram_read_int(RRAM_INT_SLEEPTIME) % 300 ) == 0 ) || rram_read_int(RRAM_INT_SLEEPTIME) < 5 ) )
    //  printf("powered %i\n", rram_read_int(RRAM_INT_SLEEPTIME));
  }
  if(firstSecond)
  {
    printf("PWS 0x%x PS 0x%x RS 0x%x - %i rtc %i\n",
         pmu_wake_status,
         pmu_status,
         reset_status,
         wake_reason,
         rtc_remaining  );
    firstSecond = 0;
  }

  cmn_int_handler( INT_TICKSECOND, 0 );
}

