darren1713/elua/src/platform/sim3u1xx/platform.c
static u8 seconds_tick_pending = 0;
void TIMER0H_IRQHandler(void)
{
#if defined( BUILD_USB_CDC )
  usb_pcb_t *pcb = usb_pcb_get();
  //Check if USB is powered. It will not actually TX/RX unless enumerated though
  if( SI32_VREG_A_is_vbus_valid( SI32_VREG_0 ) )
  {
    if( pcb->connected == false )
    {
      SI32_USB_A_enable_internal_pull_up( SI32_USB_0 );
    }
    console_cdc_active = 1;
    pcb->connected = true;
  }
  else
  {
    if( pcb->connected == true )
    {
      SI32_USB_A_suspend_usb_oscillator( SI32_USB_0 );
      SI32_USB_A_disable_internal_pull_up( SI32_USB_0 );
    }
    console_cdc_active = 0;
    pcb->connected = false;
    pcb->flags = 0;
  }

  usb_poll();
#endif

#if defined( INT_SYSTICK )
  cmn_int_handler( INT_SYSTICK, 0 );
#endif


  if(seconds_tick_pending)
  {
    SecondsTick_Handler();
    seconds_tick_pending = 0;
  }

  // Clear the interrupt flag
  SI32_TIMER_A_clear_high_overflow_interrupt(SI32_TIMER_0);
}

// SysTick interrupt handler
void SysTick_Handler()
{
  // Handle virtual timers
  cmn_virtual_timer_cb();

  cmn_systimer_periodic();

  tickSeconds++;
  if(tickSeconds == SYSTICKHZ)
  {
    seconds_tick_pending = 1;
    tickSeconds = 0;
  }
  if(i2c_timeout_timer)
    i2c_timeout_timer--;
}

static void gTIMER0_enter_auto_reload_config(void)
{
  // ENABLE TIMER0 CLOCK
  SI32_CLKCTRL_A_enable_apb_to_modules_0(SI32_CLKCTRL_0,
    SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_ENABLED_U32);

  // INITIALIZE TIMER
  SI32_TIMER_A_initialize (SI32_TIMER_0, 0x00, 0x00, 0x00, 0x00);
  SI32_TIMER_A_select_single_timer_mode (SI32_TIMER_0);
  SI32_TIMER_A_select_high_clock_source_apb_clock (SI32_TIMER_0);
  SI32_TIMER_A_select_high_auto_reload_mode (SI32_TIMER_0);

  // Set overflow frequency to SYSTICKHZ
  SI32_TIMER_A_write_capture (SI32_TIMER_0, (unsigned) -(cmsis_get_cpu_frequency()/SYSTICKHZ));
  SI32_TIMER_A_write_count (SI32_TIMER_0, (unsigned) -(cmsis_get_cpu_frequency()/SYSTICKHZ));

  // Run Timer
  SI32_TIMER_A_start_high_timer(SI32_TIMER_0);

  // ENABLE INTERRUPTS
  NVIC_ClearPendingIRQ(TIMER0H_IRQn);
  NVIC_EnableIRQ(TIMER0H_IRQn);
  SI32_TIMER_A_enable_high_overflow_interrupt(SI32_TIMER_0);
}

static void gTIMER1_enter_auto_reload_config(void)
{
  // ENABLE TIMER1 CLOCK
  SI32_CLKCTRL_A_enable_apb_to_modules_0(SI32_CLKCTRL_0,
    SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_ENABLED_U32);

  // INITIALIZE TIMER
  SI32_TIMER_A_initialize (SI32_TIMER_1, 0x00, 0x00, 0x00, 0x00);
  SI32_TIMER_A_select_single_timer_mode (SI32_TIMER_1);
  SI32_TIMER_A_select_high_clock_source_apb_clock (SI32_TIMER_1);
  SI32_TIMER_A_select_high_auto_reload_mode (SI32_TIMER_1);

  // Set overflow frequency to SYSTICKHZ
  SI32_TIMER_A_write_capture (SI32_TIMER_1, (unsigned) -(cmsis_get_cpu_frequency()/TIMER1_HZ));
  SI32_TIMER_A_write_count (SI32_TIMER_1, (unsigned) -(cmsis_get_cpu_frequency()/TIMER1_HZ));

  // Run Timer
  SI32_TIMER_A_start_high_timer(SI32_TIMER_1);

  // ENABLE INTERRUPTS
  NVIC_ClearPendingIRQ(TIMER1H_IRQn);
  NVIC_EnableIRQ(TIMER1H_IRQn);
  SI32_TIMER_A_enable_high_overflow_interrupt(SI32_TIMER_1);
}

// ****************************************************************************
// PIO section


void pios_init( void )
{
#if defined( ELUA_BOARD_GSATMICRO_V10 )
  SI32_PBCFG_A_unlock_ports(SI32_PBCFG_0);

  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_0, 0x0003);
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_0, 0x3F54);

  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_0, 0x0003);
  //ENABLE PWM CHANNELS  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_0, 0x3F03);
  //Attach PWM pins to crossbar signal
  SI32_PBCFG_A_enable_xbar0_signal(SI32_PBCFG_0, SI32_XBAR0_EPCA0_CEX0_5);

  // PB1 Setup
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_1, 0x07A1);
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_1, 0xFC1C);

#if defined( BLUETOOTH_ENABLE_TDI_DTR )
  SI32_PBSTD_A_set_pins_digital_input( SI32_PBSTD_1, 1 << 4 );
#endif

#if defined( BLUETOOTH_ENABLE_TDO_DSR )
  SI32_PBCFG_A_disable_jtag(SI32_PBCFG_0);
  SI32_PBSTD_A_set_pins_push_pull_output( SI32_PBSTD_1, 1 << 3 );
  SI32_PBSTD_A_write_pins_high(SI32_PBSTD_1, 1 << 3 );

  //Crank up power on bluetooth enable pin
  SI32_PBSTD_A_set_pins_high_drive_strength( SI32_PBSTD_1, 1 << 7 );
#endif

  // Analog Pins (1.14 & 1.15)
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_1, 0xC000);
  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_1, 0xC000);

  SI32_PBSTD_A_write_pins_high(SI32_PBSTD_1, 0x0100 ); //Set USB high power mode

  SI32_PBSTD_A_write_pins_low(SI32_PBSTD_0, 0x3FF0);
  SI32_PBSTD_A_set_pins_push_pull_output( SI32_PBSTD_1, 1 << 10);
  SI32_PBSTD_A_write_pins_low( SI32_PBSTD_1, 1 << 10 );

  // Enable Crossbar0 signals & set properties
  SI32_PBCFG_A_enable_xbar0l_peripherals(SI32_PBCFG_0,
                                         SI32_PBCFG_A_XBAR0L_USART0EN |
                                         SI32_PBCFG_A_XBAR0L_USART1EN |
                                         SI32_PBCFG_A_XBAR0L_USART1FCEN |
                                         SI32_PBCFG_A_XBAR0L_I2C0EN);
  SI32_PBCFG_A_enable_xbar0h_peripherals(SI32_PBCFG_0,
                                         SI32_PBCFG_A_XBAR0H_UART0EN |
                                         SI32_PBCFG_A_XBAR0H_UART1EN);
  SI32_PBCFG_A_enable_crossbar_0(SI32_PBCFG_0);

  // PB2 Setup
#if defined(BUILD_SPI1)
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_2, 0x003F);
#else
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_2, 0xFFFF);
#endif

  SI32_PBSTD_A_disable_pullup_resistors( SI32_PBSTD_2 );

  // PB3 Setup
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_3, 0xFFFF);

  SI32_PBSTD_A_disable_pullup_resistors( SI32_PBSTD_3 );


  SI32_PBSTD_A_disable_pullup_resistors( SI32_PBSTD_1 );

  //PB3.8 is high voltage dc detection
  //PB3.9 is usb voltage detection
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_3, 0x00000300);
  //PB3.11 5V on/off

  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_3, ( u32 ) 1 << 11);
  SI32_PBSTD_A_write_pins_low(SI32_PBSTD_3, ( u32 ) 1 << 11 ); //Set 5V regulator off
  // PB2.1 is wakeup
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_2, 0x00000002);

  //PB0.1 is external input 2
  //PB0.0 is accel INT1
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_0, 0x00000003);
  SI32_PBSTD_A_disable_pullup_resistors( SI32_PBSTD_0 );

#if defined(BUILD_SPI1)
  SI32_PBCFG_A_enable_xbar1_peripherals(SI32_PBCFG_0, SI32_PBCFG_A_XBAR1_SPI1EN);
#endif

  // Enable Crossbar1 signals & set properties
  SI32_PBCFG_A_enable_crossbar_1(SI32_PBCFG_0);

  // Setup PBHD4
  SI32_PBCFG_A_unlock_ports(SI32_PBCFG_0);
  SI32_PBHD_A_write_pblock(SI32_PBHD_4, 0x00);

  SI32_PBHD_A_select_pin0_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin1_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin2_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin3_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin4_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin5_safe_state(SI32_PBHD_4, 0x0);

  SI32_PBHD_A_enable_bias(SI32_PBHD_4);
  SI32_PBHD_A_select_normal_power_port_mode(SI32_PBHD_4);
  SI32_PBHD_A_enable_drivers(SI32_PBHD_4);

