darren1713/elua/src/platform/sim3u1xx/platform.c
int platform_s_uart_set_flow_control( unsigned id, int type )
{
  if( id < 2 )
  {
    if( type == PLATFORM_UART_FLOW_NONE )
    {
      SI32_USART_A_disable_cts( usart[ id ] );
      SI32_USART_A_disable_rts( usart[ id ] );
    }
    if( type & PLATFORM_UART_FLOW_CTS )
    {
      SI32_USART_A_enable_cts( usart[ id ] );
    }
    if( type & PLATFORM_UART_FLOW_RTS )
    {
      SI32_USART_A_enable_rts( usart[ id ] );
    }
  }
  else
  {
    id = id - 2;
    if( type == PLATFORM_UART_FLOW_NONE )
    {
      SI32_UART_A_disable_cts( uart[ id ] );
      SI32_UART_A_disable_rts( uart[ id ] );
    }
    if( type & PLATFORM_UART_FLOW_CTS )
    {
      SI32_UART_A_enable_cts( uart[ id ] );
    }
    if( type & PLATFORM_UART_FLOW_RTS )
    {
      SI32_UART_A_enable_rts( uart[ id ] );
    }
  }

  return PLATFORM_OK;
}

// ****************************************************************************
// Timer section


/*
// Helper function: get timer clock
static u32 platform_timer_get_clock( unsigned id )
{
  return 0;
}

// Helper function: set timer clock
static u32 platform_timer_set_clock( unsigned id, u32 clock )
{
  return clock;
}

// Helper function: setup timers
static void platform_setup_timers()
{

}*/

int platform_s_timer_set_match_int( unsigned id, timer_data_type period_us, int type )
{
    return PLATFORM_TIMER_INT_OK;
}

void platform_s_timer_delay( unsigned id, timer_data_type delay_us )
{

}

timer_data_type platform_s_timer_op( unsigned id, int op, timer_data_type data )
{
  u32 res = 0;

  switch( op )
  {
    case PLATFORM_TIMER_OP_START:
      break;

    case PLATFORM_TIMER_OP_READ:
      if( id == 0 )
      {
        SI32_RTC_A_start_timer_capture(SI32_RTC_0);
        while(SI32_RTC_A_is_timer_capture_in_progress(SI32_RTC_0));
        res = SI32_RTC_A_read_setcap(SI32_RTC_0);
      }
      break;

    case PLATFORM_TIMER_OP_SET_CLOCK:
      break;

    case PLATFORM_TIMER_OP_GET_CLOCK:
      if( id == 0 )
      {
        if( rram_read_int(RRAM_INT_CLK_CORR) != 0 )
          res = ( u64 )16384 *  ( u64 )rram_read_int(RRAM_INT_CLK_CORR) / ( u64 )1000000;
        else
          res = 16384;
      }
      break;

    case PLATFORM_TIMER_OP_GET_MAX_CNT:
        res = 0xFFFFFFFF;
      break;
  }
  return res;
}

u64 platform_timer_sys_raw_read()
{
  return SysTick->LOAD - SysTick->VAL;
}

void platform_timer_sys_disable_int()
{
  SysTick->CTRL &= ~SysTick_CTRL_TICKINT_Msk;
}

void platform_timer_sys_enable_int()
{
  SysTick->CTRL |= SysTick_CTRL_TICKINT_Msk;
}

timer_data_type platform_timer_read_sys()
{
  return cmn_systimer_get();
}

// *****************************************************************************
// ADC specific functions and variables

#ifdef BUILD_ADC
// PB1.14: ADC1.4
// PB1.15: ADC1.3
// VREGIN / 4: ADC1.17

#define SI32_ADC      SI32_SARADC_1
#define SI32_ADC_IRQ  SARADC1_IRQn

const static u32 adc_ctls[] = { 4, 3, 17 };

int platform_adc_check_timer_id( unsigned id, unsigned timer_id )
{
  //return ( ( timer_id >= ADC_TIMER_FIRST_ID ) && ( timer_id < ( ADC_TIMER_FIRST_ID + ADC_NUM_TIMERS ) ) );
  return 0;
}

void platform_adc_stop( unsigned id )
{
  elua_adc_ch_state *s = adc_get_ch_state( id );
  elua_adc_dev_state *d = adc_get_dev_state( 0 );

  s->op_pending = 0;
  INACTIVATE_CHANNEL(d, id);

  // If there are no more active channels, stop the sequencer
  if( d->ch_active == 0 )
  {
    //SI32_SARADC_A_disable_autoscan( SI32_ADC );
    SI32_SARADC_A_disable_module(SI32_ADC);
    //printf("Stoppit!\n");
    d->running = 0;
  }
}

// Handle ADC interrupts
void SARADC1_IRQHandler( void )
{
  //u32 tmpbuff[ NUM_ADC ];
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  elua_adc_ch_state *s;

  if ( SI32_SARADC_A_is_scan_done_interrupt_pending( SI32_ADC ) )
  {
    SI32_SARADC_A_clear_single_conversion_complete_interrupt( SI32_ADC );
    SI32_SARADC_A_clear_scan_done_interrupt( SI32_ADC );
    SI32_SARADC_A_disable_autoscan( SI32_ADC );
    SI32_SARADC_A_disable_accumulator( SI32_ADC );

    d->seq_ctr = 0;

    // Update smoothing and/or write to buffer if needed
    while( d->seq_ctr < d->seq_len )
    {
      //printf( "Ctr: %d ", d->seq_ctr );
      s = d->ch_state[ d->seq_ctr ];
      d->sample_buf[ s->id ] = ( u16 )( SI32_SARADC_A_read_data( SI32_ADC ) / 16 );
      //printf("Value: %d\n", d->sample_buf[ d->seq_ctr ] );
      s->value_fresh = 1; // Mark sample as fresh

      // Fill in smoothing buffer until warmed up
      if ( s->logsmoothlen > 0 && s->smooth_ready == 0)
        adc_smooth_data( s->id );

#if defined( BUF_ENABLE_ADC )
      else if ( s->reqsamples > 1 )
      {
        buf_write( BUF_ID_ADC, s->id, ( t_buf_data* )s->value_ptr );
        s->value_fresh = 0;
      }
#endif

      // If we have the number of requested samples, stop sampling
      if ( adc_samples_available( s->id ) >= s->reqsamples && s->freerunning == 0 )
        platform_adc_stop( s->id );

      d->seq_ctr++;
    }
    d->seq_ctr = 0;

    // Only attempt to refresh sequence order if still running
    // This allows us to "cache" an old sequence if all channels
    // finish at the same time
    if ( d->running == 1 )
      adc_update_dev_sequence( 0 );

    if ( d->clocked == 0 && d->running == 1 )
    {
      SI32_SARADC_A_enable_burst_mode(SI32_ADC);
      SI32_SARADC_A_enable_autoscan(SI32_ADC);

      // a 1-to-0 transition on ACCMD bit will enable the accumulator for the next conversion
      SI32_SARADC_A_enable_accumulator(SI32_ADC);
      SI32_SARADC_A_clear_accumulator(SI32_ADC);
      SI32_SARADC_A_start_conversion( SI32_ADC );
    }
  }
  else if ( SI32_SARADC_A_is_single_conversion_complete_interrupt_pending( SI32_ADC ) )
  {
    SI32_SARADC_A_clear_single_conversion_complete_interrupt( SI32_ADC );
    SI32_SARADC_A_enable_burst_mode( SI32_ADC );
    SI32_SARADC_A_start_conversion( SI32_ADC );
    //printf("Single\n");
  }
}

#define ADC_CLK 1000000

static void adcs_init()
{
  unsigned id;
  //elua_adc_dev_state *d = adc_get_dev_state( 0 );
  // Fclk_SAR = (2 x Fapb)/(sar_clk_div +1).
  SI32_SARADC_A_select_sar_clock_divider( SI32_ADC, ( div_round_closest( 2 * cmsis_get_cpu_frequency(), ADC_CLK )  - 1 ) );

  SI32_SARADC_A_select_output_packing_mode_lower_halfword_only( SI32_ADC );

  SI32_SARADC_A_select_start_of_conversion_source( SI32_ADC, SI32_SARADC_A_CONTROL_SCSEL_ADCNT0_VALUE );

  SI32_SARADC_A_select_burst_mode_clock_apb_clock( SI32_ADC );

  // adc will run through one scan of all enabled time sequences once
  SI32_SARADC_A_select_autoscan_mode_once( SI32_ADC );

  SI32_SARADC_A_enable_common_mode_buffer( SI32_ADC );

  SI32_SARADC_A_select_vref_internal( SI32_ADC );

