darren1713/elua/src/platform/sim3u1xx/platform.c
    printf("R CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif

    return ( u8 )tmpdata;
  }
  else
  {
#if defined( DEBUG_I2C )
    printf("recv_byte: not active\n");
#endif
    i2c_reset_pending = 1;
    return 0;
  }
}

#endif // NUM_I2C > 0

// ****************************************************************************
// PMU functions

void sim3_pmu_sleep( int seconds )
{
  if( seconds < 0 )
    seconds = 1;

  #ifdef EXTRA_SLEEP_HOOK
    extras_sleep_hook(seconds);
  #endif

  // GET CURRENT TIMER VALUE INTO SETCAP
  SI32_RTC_A_start_timer_capture(SI32_RTC_0);
  while(SI32_RTC_A_is_timer_capture_in_progress(SI32_RTC_0));

  // SET ALARM FOR now+s
  // RTC running at 16.384Khz so there are 16384 cycles/sec)
  SI32_RTC_A_write_alarm0(SI32_RTC_0, SI32_RTC_A_read_setcap(SI32_RTC_0) + (platform_timer_op(0, PLATFORM_TIMER_OP_GET_CLOCK, 0) * seconds));
  SI32_RTC_A_clear_alarm0_interrupt(SI32_RTC_0);

  // Enable RTC alarm interrupt
  SI32_RTC_A_enable_alarm0_interrupt(SI32_RTC_0);

  // Disable crossbar peripheral connections
  //SI32_PBCFG_A_write_xbar1(SI32_PBCFG_0,0x00000000);
  //SI32_PBCFG_A_write_xbar0h(SI32_PBCFG_0,0x00000000);
  //SI32_PBCFG_A_write_xbar0l(SI32_PBCFG_0,0x00000000);

  // Mask low priority interrupts from waking us
  __set_BASEPRI(0x40);

  SI32_DMACTRL_A_disable_module( SI32_DMACTRL_0 );
  SI32_CLKCTRL_A_exit_fast_wake_mode( SI32_CLKCTRL_0 );
  SI32_RSTSRC_A_disable_power_mode_9( SI32_RSTSRC_0 );

  // Switch VREG to low power mode
  if(extras_minimum_sleep_power() <= LIGHT_LOAD_BETWEEN_20MA_TO_5MA)
    SI32_VREG_A_enter_suspend_mode(SI32_VREG_0);
  if(extras_minimum_sleep_power() == VERY_LIGHT_LOAD_UNDER_5MA)
    SI32_VREG_A_disable_band_gap(SI32_VREG_0);


  //SI32_VREG_A_disable_band_gap( SI32_VREG_0 );
  //SI32_VREG_A_enter_suspend_mode( SI32_VREG_0 );
  
  //SI32_VREG_A_enable_vbus_invalid_interrupt( SI32_VREG_0 );

  // Disable VDD Monitor
  SI32_VMON_A_disable_vdd_supply_monitor(SI32_VMON_0);

  // Switch AHB source to LFO oscillator
  SI32_CLKCTRL_A_select_ahb_source_low_frequency_oscillator( SI32_CLKCTRL_0 );

  // Turn off all peripheral clocks
  SI32_CLKCTRL_A_disable_apb_to_all_modules( SI32_CLKCTRL_0 );

  __WFI();

  SI32_CLKCTRL_A_select_ahb_source_low_power_oscillator(SI32_CLKCTRL_0);

  // Allow all interrupts
  __set_BASEPRI(0x00);

  // Re-enable clocks used at startup
  clk_init();
  pios_init();

  SI32_VREG_A_enable_band_gap( SI32_VREG_0 );
  SI32_EXTVREG_A_enable_module( SI32_EXTVREG_0 );
}

void sim3_pmu_reboot( void )
{
  // Stop USB
  SI32_USB_A_reset_module( SI32_USB_0 );
  NVIC_DisableIRQ(USB0_IRQn);
  SI32_USB_A_disable_module(SI32_USB_0);
  SI32_USB_A_disable_internal_pull_up( SI32_USB_0 );
  reset_parameters();

  platform_timer_sys_delay( 200e3 );

  SI32_RSTSRC_A_generate_software_reset( SI32_RSTSRC_0 );
}

void sim3_pmu_reboot_nodfu( void )
{
  sim3_pmu_pm9(TRICK_TO_REBOOT_WITHOUT_DFU_MODE);
}

void memory_error( void )
{
  sim3_pmu_reboot();
}

void myPMU_enter_sleep(void)
{
  // Configure for Sleep
  SI32_PMU_A_clear_wakeup_flags(SI32_PMU_0);
  SI32_RSTSRC_A_enable_power_mode_9(SI32_RSTSRC_0);
  SCB->SCR = SCB_SCR_SLEEPDEEP_Msk; // set SLEEPDEEP
  __set_FAULTMASK(1);
  __WFI();
}

void VREG0_vbus_invalid_handler(void)
{
}

#define BT_TX_PIN 4
#define BT_RX_PIN 5
#define BT_RTS_PIN 6
#define BT_CTS_PIN 7

void myPB_enter_off_config()
{
   // all ports hi-z (analog)
  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_0, 0x0000FFFF);
  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_1, 0x0000FFFF);
  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_2, 0x0000FFFF);
  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_3, 0x0000FFFF);

  SI32_PBCFG_A_unlock_ports(SI32_PBCFG_0);
  SI32_PBHD_A_write_pblock(SI32_PBHD_4, 0x00);

  SI32_PBCFG_A_enable_xbar0h_peripherals(SI32_PBCFG_0, 0x0000);
  SI32_PBCFG_A_enable_xbar0l_peripherals(SI32_PBCFG_0, 0x0000);
  SI32_PBCFG_A_enable_xbar1_peripherals(SI32_PBCFG_0, 0x0000);
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_0, 0xFFFF);
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_1, 0xFFFF);
  SI32_PBCFG_A_enable_crossbar_0(SI32_PBCFG_0);
  SI32_PBCFG_A_enable_crossbar_1(SI32_PBCFG_0);

  int i;
  for( i=0; i<4; i++)
  {
    SI32_PBSTD_A_set_pins_analog(port_std[ i ], 0x0000);
       // basePointer->PBMDSEL_CLR = pin_mask;
       // basePointer->PB_SET      = pin_mask;
    SI32_PBSTD_A_write_pbskipen(port_std[ i ], 0xFFFF);
       // basePointer->PBSKIPEN.U32 = pbskipen;
    SI32_PBSTD_A_set_pins_digital_input( port_std[ i ], 0xFFFF);
       // basePointer->PBOUTMD_CLR = pin_mask;
       // basePointer->PB_SET      = pin_mask;
       // basePointer->PBMDSEL_SET = pin_mask;
    SI32_PBSTD_A_disable_pullup_resistors( port_std[ i ] );
       // basePointer->PBDRV_CLR = SI32_PBSTD_A_PBDRV_PBPUEN_MASK;
    SI32_PBSTD_A_write_pins_low( port_std[ i ], 0xFFFF );
       // basePointer->PB_CLR = pin_mask
  }

  //JEFF TEST
  //SI32_PBCFG_A_write_xbar1(SI32_PBCFG_0,0x00000000);
  //SI32_PBCFG_A_write_xbar0h(SI32_PBCFG_0,0x00000000);
  //SI32_PBCFG_A_write_xbar0l(SI32_PBCFG_0,0x00000000);



  //Set I2C pins to analog float...
  SI32_PBSTD_A_set_pins_analog( SI32_PBSTD_0, 0x0000C000);
  SI32_PBSTD_A_write_pins_low( SI32_PBSTD_0, 0xC000 );

  SI32_PBSTD_A_set_pins_push_pull_output( SI32_PBSTD_1, 1 << 10);
  SI32_PBSTD_A_write_pins_low( SI32_PBSTD_1, 1 << 10 );

#ifdef BLUETOOTH_POWEREDWHILESLEEPING
  //Set bluetooth pins to analog high...
  if( ( rram_read_bit( RRAM_BIT_STORAGE_MODE ) == STORAGE_MODE_DISABLED ) &&
      ( rram_read_bit( RRAM_BIT_TEMP_STORAGE_MODE ) == TEMP_STORAGE_MODE_DISABLED ) &&
      ( rram_read_bit( RRAM_BIT_BLE_OFF ) == BLE_OFF_DISABLED /* enabled */ ) )
  {
    SI32_PBSTD_A_set_pins_push_pull_output( SI32_PBSTD_1, 0x0080);
    SI32_PBSTD_A_write_pins_high( SI32_PBSTD_1, 0x0080 );
#if defined( BLUETOOTH_ENABLE_TDI_DTR )
  SI32_PBSTD_A_set_pins_digital_input( SI32_PBSTD_1, 1 << 4 );
#endif
    SI32_PBSTD_A_set_pins_push_pull_output( SI32_PBSTD_0, 1 << BT_RTS_PIN);
    SI32_PBSTD_A_write_pins_high( SI32_PBSTD_0, 1 << BT_RTS_PIN );
#if defined( BLUETOOTH_ENABLE_TDO_DSR )
    SI32_PBSTD_A_set_pins_push_pull_output( SI32_PBSTD_1, 1 << 3);
    SI32_PBSTD_A_write_pins_high(SI32_PBSTD_1, 1 << 3 );
#endif
    SI32_PBSTD_A_set_pins_digital_input( SI32_PBSTD_0, ( ( 1 << BT_RX_PIN ) | ( 1 << BT_CTS_PIN ) ));
  }
  else
  {
    rram_write_bit(RRAM_BIT_BLUETOOTH_WAKE, BLUETOOTH_WAKE_DISABLED);
  }
#endif



