darren1713/elua/src/platform/sim3u1xx/platform.c
  SI32_RSTSRC_0->RESETEN_SET = SI32_RSTSRC_A_RESETEN_WAKEREN_MASK | 0x0000003; //replace incorrect SI32_PMU_A_enable_pin_wake_reset
  SI32_PMU_A_enable_pin_wake_event( SI32_PMU_0 );
  SI32_PMU_A_enable_pin_wake( SI32_PMU_0 );

  SI32_PMU_A_clear_wakeup_flags( SI32_PMU_0 );
  //>>HERE
  SI32_RTC_A_start_timer(SI32_RTC_0); //Start count down to wakeup
  myPMU_enter_sleep();

  // DISABLE all wakeup sources
  SI32_PMU_A_write_wakeen(SI32_PMU_0, 0x0);

  SI32_RSTSRC_A_enable_power_mode_9(SI32_RSTSRC_0);
  SI32_RSTSRC_A_enable_rtc0_reset_source(SI32_RSTSRC_0);
  //SI32_RSTSRC_A_enable_comparator0_reset_source( SI32_RSTSRC_0 ); //JEFF TESTING WAKE ON EXTERNAL POWER: doesn't work, not adding it. Might need to configure CMP0
}

// ****************************************************************************
// PBHD functions

//  SI32_PBHD_A_select_low_power_port_mode(SI32_PBHD_4);  //needs to be high power if VDDHD >3.6v
//  SI32_PBHD_A_select_slew_rate(SI32_PBHD_4, SI32_PBHD_A_SLEW_FASTEST);
//  SI32_PBHD_A_set_pins_low_drive_strength(SI32_PBHD_4, 0x3F);
//  SI32_PBHD_A_enable_drivers(SI32_PBHD_4);

void sim3_pbhd_setbias( unsigned state )
{
  //  SI32_PBHD_A_enable_bias(SI32_PBHD_4)
}

void sim3_pbhd_setdrive( unsigned state )
{

}

void sim3_pbhd_setslew( unsigned state )
{

}

void sim3_pbhd_setdrivestrength( unsigned state, int pin )
{

}

// ****************************************************************************
// Flash access functions

volatile u8 flash_key_mask  = 0x00;
volatile u8 armed_flash_key = 0x00;

u8 flash_erase( u32 address, u8 verify)
{
    u32 wc;
    u32* verify_address;
    printf("EFLASH %08lX\n", address);

    // Disable interrupts
    //hw_intp_disable();
    __disable_irq();

    // Write the address of the Flash page to WRADDR
    SI32_FLASHCTRL_A_write_wraddr( SI32_FLASHCTRL_0, address );
    // Enter Flash Erase Mode
    SI32_FLASHCTRL_A_enter_flash_erase_mode( SI32_FLASHCTRL_0 );

    // Unlock the flash interface for a single access
    SI32_FLASHCTRL_A_write_flash_key(SI32_FLASHCTRL_0, flash_key_mask ^ 0xA4);
    SI32_FLASHCTRL_A_write_flash_key(SI32_FLASHCTRL_0, flash_key_mask ^ 0xF0);

    // Write any value to initiate a page erase.
    SI32_FLASHCTRL_A_write_wrdata(SI32_FLASHCTRL_0, 0x0000);

    // Wait for flash operation to complete
    // THIS IS ABSOLUTELY REQUIRED
    while (SI32_FLASHCTRL_A_is_flash_busy(SI32_FLASHCTRL_0))
    {
      WDTIMER0_IRQHandler();
    }

    if( verify )
    {
        address &= ~(INTERNAL_FLASH_SECTOR_SIZE - 1); // Round down to nearest even page address
        verify_address = (u32*)address;

        for( wc = 0; wc < (INTERNAL_FLASH_SECTOR_SIZE/4); wc++ )
        {
            if ( *verify_address != 0xFFFFFFFF )
            {
              __enable_irq();
              printf("EFLASH FAIL %p %08lX\n", verify_address, *verify_address);
              return 1;
            }
            verify_address++;
        }
    }

    //hw_intp_enable();
    __enable_irq();

    return 0;
}

u8 flash_write( u32 address, u32* data, u32 count, u8 verify )
{
    u32* tmpdata = data;
    u32* verify_address;
    u32 wc;

    // disable interrupts
    //hw_intp_disable();
    __disable_irq();

    // Exit flash erase mode
    SI32_FLASHCTRL_A_exit_flash_erase_mode(SI32_FLASHCTRL_0);

    // Write word-sized
    for( wc = 0; wc < count; wc++ )
    {
        // Unlock flash interface for single write
        SI32_FLASHCTRL_A_write_flash_key(SI32_FLASHCTRL_0, flash_key_mask ^ 0xA4); //OxA5
        SI32_FLASHCTRL_A_write_flash_key(SI32_FLASHCTRL_0, flash_key_mask ^ 0xF0); //0xF1
        // Write the address of the Flash page to WRADDR
        SI32_FLASHCTRL_A_write_wraddr( SI32_FLASHCTRL_0, address + (wc * 4) );
        SI32_FLASHCTRL_A_write_wrdata( SI32_FLASHCTRL_0, *data );

        // Unlock flash interface for single write
        SI32_FLASHCTRL_A_write_flash_key(SI32_FLASHCTRL_0, flash_key_mask ^ 0xA4); //OxA5
        SI32_FLASHCTRL_A_write_flash_key(SI32_FLASHCTRL_0, flash_key_mask ^ 0xF0); //0xF1
        // Write the address of the Flash page to WRADDR
        SI32_FLASHCTRL_A_write_wraddr( SI32_FLASHCTRL_0, address + (wc * 4) + 2 );
        SI32_FLASHCTRL_A_write_wrdata( SI32_FLASHCTRL_0, *data >> 16 );
        
        //printf("WFLASH %08X %08X\n", address + (wc * 2), *data);
        data++;
        WDTIMER0_IRQHandler();
    }

    // This causes errors....not needed for flash writes, only erase?
    // Wait for flash operation to complete
    // 
    //while( SI32_FLASHCTRL_A_is_flash_busy(SI32_FLASHCTRL_0 ) )
    //{
    //  WDTIMER0_IRQHandler();
    //}

    if( verify )
    {
        verify_address = (u32*)address;

        for( wc = 0; wc < count; wc++ )
        {
            if (*verify_address != tmpdata[wc])
            {
              __enable_irq();
              printf("WFLASH FAIL %08lX %08lX\n", *verify_address, tmpdata[wc]);
              return 1;
            }
            verify_address++;
        }
    }

    // re-enable interrupts
    //hw_intp_enable();
    __enable_irq();

    return 0;
}

u32 platform_s_flash_write( const void *from, u32 toaddr, u32 size )
{
  flash_key_mask = 0x01;
  if( 0 != flash_write( toaddr, ( u32 * )from, (size + (INTERNAL_FLASH_WRITE_UNIT_SIZE - 1))/INTERNAL_FLASH_WRITE_UNIT_SIZE, 1 ) ) // round up size to count of 4-byte words needed
    return 0;
  else
    return size;
}

int platform_flash_erase_sector( u32 sector_id )
{
  flash_key_mask = 0x01;
  return flash_erase( sector_id * INTERNAL_FLASH_SECTOR_SIZE + INTERNAL_FLASH_START_ADDRESS, 1) == 0 ? PLATFORM_OK : PLATFORM_ERR;
}

// ****************************************************************************
// USB functions

#if defined( BUILD_USB_CDC )

unsigned platform_get_console_uart( void )
{
  return CON_UART_ID;
}

void sim3_usb_cdc_send( u8 data )
{
  usb_pcb_t *pcb = usb_pcb_get();

  if (!(pcb->flags & (1<<ENUMERATED)))
  {
      return;
  }
  if(usb_buf_space(EP_1) == 0)
      return;

  if(usb_buf_write(EP_1, (U8)data) == 0)
    usb_poll();//ep_write(EP_1);
}

int sim3_usb_cdc_recv( s32 timeout )
{
  usb_pcb_t *pcb = usb_pcb_get();

  if (!(pcb->flags & (1<<ENUMERATED)))
      return -1;

  if(/*usb_buf_bytes(EP_3)*/pcb->fifo[EP_3].len > 0 )
    return usb_buf_read(EP_3);
  else
    return -1;
}

#endif




// ****************************************************************************
// Platform specific modules go here
// #ifdef PS_LIB_TABLE_NAME


// #define MIN_OPT_LEVEL 2
// #include "lrodefs.h"
// #ifdef ENABLE_PMU
// extern const LUA_REG_TYPE pmu_map[];
// #endif

// // #if defined( EXTRA_LIBS_INCLUDE )
// // #include "extra_libs.h"
// // #endif

// // #if defined( SIM3_EXTRA_LIBS_ROM ) && LUA_OPTIMIZE_MEMORY == 2
// // #define _EXTRAROM( name, openf, table ) extern const LUA_REG_TYPE table[];
// // SIM3_EXTRA_LIBS_ROM;
// // #endif

// const LUA_REG_TYPE platform_map[] =
// {
// //#if LUA_OPTIMIZE_MEMORY > 0
//   //{ LSTRKEY( "pmu" ), LROVAL( pmu_map ) },
// // #if defined(SIM3_EXTRA_LIBS_ROM)
// // #undef _EXTRAROM
// // #define _EXTRAROM( name, openf, table ) { LSTRKEY( #name ), LROVAL( table ) },
// //   SIM3_EXTRA_LIBS_ROM
// // #endif
// // #endif
//   { LNILKEY, LNILVAL }
// };

// LUALIB_API int luaopen_platform( lua_State *L )
// {
// #if LUA_OPTIMIZE_MEMORY > 0
//   return 0;
// #else // #if LUA_OPTIMIZE_MEMORY > 0
//   //Turn on aggressive emergency garbage collection
//   legc_set_mode( L, EGC_ALWAYS, 20);

//   luaL_register( L, PS_LIB_TABLE_NAME, platform_map );

//   // Setup the new tables inside platform table
//   // lua_newtable( L );
//   // luaL_register( L, NULL, pmu_map );
//   // lua_setfield( L, -2, "pmu" );

// #if defined( SIM3_EXTRA_LIBS_ROM )
// #undef _EXTRAROM
/* #define _EXTRAROM( name, openf, table ) \
//   lua_newtable( L ); \
//   luaL_register( L, NULL, table ); \
//   lua_setfield( L, -2, #name ); */
// #endif

//   return 1;
// #endif // #if LUA_OPTIMIZE_MEMORY > 0
// }

// #else // #ifdef ENABLE_PMU

// LUALIB_API int luaopen_platform( lua_State *L )
// {
//   return 0;
// }

// #endif // #ifdef ENABLE_PMU
